// Стивен хочет, чтобы вы улучшили его калькулятор чаевых, используя те же правила, что и раньше: чаевые составляют 15 % от суммы счета, если сумма счета составляет от 50 до 300, а если сумма другая, чаевые составляют 20 %.

// Ваши задачи:

// Напишите функцию calcTip, которая принимает любую сумму счета в качестве входных данных и возвращает соответствующие чаевые, рассчитанные на основе приведенных выше правил (при необходимости вы можете проверить код из первого задания калькулятора чаевых). Используйте тип функции, который вам нравится больше всего. Протестируйте функцию, используя значение счета 100.

// А теперь давайте использовать массивы! Итак, создайте массив с именем, billsсодержащий тестовые данные ниже.

// Создайте массив с именем tips, содержащий сумму чаевых для каждой купюры, рассчитанную с помощью созданной вами ранее функции.

// БОНУС : Создайте массив totals, содержащий общие значения, чтобы файл bill + tip.

// ТЕСТОВЫЕ ДАННЫЕ : 125, 555 и 44.